a, b, = input(), input()
if a == b:
    print('ничья')
elif a == 'ножницы' and b == 'бумага' or\
        a == 'ножници' and b == 'ящерица' or\
        a == 'бумага' and b == 'камень' or\
        a == 'бумага' and b == 'Спок' or\
        a == 'камень' and b == 'ножницы' or\
        a == 'камень' and b == 'ящерица' or\
        a == 'ящерица' and b == 'бумага' or\
        a == 'ящерица' and b == 'Спок' or\
        a == 'Спок' and b == 'ножницы' or\
        a == 'Спок' and b == 'камень':
    print('Тимур')
else:
    print('Руслан')
